# 1. Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента. Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

my_list = ['строка', 99005369, 123.11, [1, 2], {3, 4}, f'sdf']
for elem in my_list:
    print(elem, type(elem))






